[Alarm.Alarm_panel_Box_twk:DisTweaks_InteractableInterface_1 DisTweaks_InteractableInterface]
m_Name="警报器面板"

[Alarm.Alarm_panel_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="警报器线路"
m_UseMessage="这个警报器已被解除"

[Alarm.AlarmBase DisTweaks_AlarmBell]
m_UnlockInteractText="`GBA_Use` 解锁"
m_LockedMessage=""
m_UnauthorizedMessage=""
m_FocusMessage=""
m_FocusLockedMessage=""

[Alarm.AlarmBase:DisTweaks_Interactable_AlarmBell_0 DisTweaks_Interactable_AlarmBell]
m_UnringAlarmText="`GBA_Use` 安静"
m_Name="警铃"
m_InteractText=" `GBA_Use` 鸣铃"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[ArcPylon.Arcpylon_eye_panel_box_twk:DisTweaks_InteractableInterface_1 DisTweaks_InteractableInterface]
m_Name="电弧塔面板"

[ArcPylon.ArcPylon_eye_panel_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="电弧塔线路"
m_UseMessage="这个电弧塔现在将会攻击敌人而不是你"

[Battery.WhaleOilBattery_empty_twk DisTweaks_WhaleOilBattery]
m_EmptyName="空的鲸油罐"

[Battery.WhaleOilBattery_empty_twk:DisTweaks_InteractableInterface_0 DisTweaks_InteractableInterface]
m_Name="鲸油罐"
m_InteractText="`GBA_Use` 携带"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Battery.WhaleOilBattery_twk DisTweaks_WhaleOilBattery]
m_EmptyName="空的鲸油罐"

[Battery.WhaleOilBattery_twk:DisTweaks_InteractableInterface_0 DisTweaks_InteractableInterface]
m_Name="鲸油罐"
m_InteractText="`GBA_Use` 携带"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Battery.WhaleOilReceptacle_twk DisTweaks_WhaleOilReceptacle]
m_EmptyBatteryMessage="这个罐子是空的"

[Battery.WhaleOilReceptacleHub_twk DisTweaks_WhaleOilReceptacle]
m_EmptyBatteryMessage="这个罐子是空的"

[Generic.Generic_eye_panel_box_twk DisTweaks_UsableObject]
m_Stages[1]=(m_InteractTextOverride="`GBA_Use` 关闭")
m_UnlockInteractText="`GBA_Use` 解锁"
m_LockedMessage=""
m_UnauthorizedMessage=""
m_FocusMessage=""
m_FocusLockedMessage=""

[Generic.Generic_eye_panel_box_twk:DisTweaks_InteractableInterface_1 DisTweaks_InteractableInterface]
m_Name="金属面板"
m_InteractText="`GBA_Use` 打开"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Generic.Generic_eye_panel_twk DisTweaks_UsableObject]
m_UnlockInteractText="`GBA_Use` 解锁"
m_LockedMessage=""
m_UnauthorizedMessage="`GBA_Use` 使用"
m_FocusMessage="剩余接线工具数量：`q"
m_FocusLockedMessage=""

[Generic.Generic_eye_panel_twk:DisTweaks_InteractableInterface_0 DisTweaks_InteractableInterface]
m_Name="线路"
m_InteractText="`GBA_Use` 接线"
m_AltInteractText=""
m_UseMessage="这个装置已经重新接线"
m_AltUseMessage=""
m_CannotUseMessage="你没有任何接线工具"

[SecurityDoor.SecurityDoor_eye_panel_box_twk:DisTweaks_InteractableInterface_1 DisTweaks_InteractableInterface]
m_Name="安全门面板"

[SecurityDoor.SecurityDoor_eye_panel_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_UseMessage="这扇门现在可以打开了"

[SecurityDoor.secutiry_door_twk DisTweaks_Door]
m_DoorOpenCCW.m_InteractTextOverride=""
m_DoorOpenCW.m_InteractTextOverride=""
m_DoorCloseCCW.m_InteractTextOverride="`GBA_Use` 关闭"
m_DoorCloseCW.m_InteractTextOverride="`GBA_Use` 关闭"
m_DoorSlamOpenCCW.m_InteractTextOverride=""
m_DoorSlamOpenCW.m_InteractTextOverride=""

[SecurityDoor.secutiry_door_twk:DisTweaks_InteractableInterface_3 DisTweaks_InteractableInterface]
m_Name="牢不可破的金属门"

[TripodTrap.BulletLauncher_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="子弹发射器"

[TripodTrap.ExplosiveBulletLauncher_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="爆炸子弹发射器"

[TripodTrap.GrenadeLauncher_twk:DisTweaks_InteractableInterface_2 DisTweaks_InteractableInterface]
m_Name="射弹发射器"
m_InteractText="`GBA_Use` 解除武装"
m_AltInteractText=""
m_UseMessage="发射器已解除武装"
m_AltUseMessage=""
m_CannotUseMessage=""

[TripodTrap.SamuelSignalLauncher_twk:DisTweaks_InteractableInterface_2 DisTweaks_InteractableInterface]
m_Name="萨缪尔的信号发射器"
m_InteractText=""
m_UseMessage=""

[TripodTrap.TrapExplosiveArrow_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="燃烧弩箭"

[TripodTrap.Tripod_twk:DisTweaks_InteractableInterface_4 DisTweaks_InteractableInterface]
m_Name=""
m_InteractText=""
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[TripodTrap.Tripwire_DoubleDoor_twk:DisTweaks_InteractableInterface_0 DisTweaks_InteractableInterface]
m_Name="绊索"
m_InteractText="`GBA_Use` 触发"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[TripodTrap.Tripwire_Hallway_twk:DisTweaks_InteractableInterface_1 DisTweaks_InteractableInterface]
m_Name="绊索"
m_InteractText="`GBA_Use` 触发"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[TripodTrap.Tripwire_SimpleDoor_twk:DisTweaks_InteractableInterface_2 DisTweaks_InteractableInterface]
m_Name="绊索"
m_InteractText="`GBA_Use` 触发"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[WallOfLight.WallOfLight_eye_panel_box_twk:DisTweaks_InteractableInterface_1 DisTweaks_InteractableInterface]
m_Name="安全门面板"

[WallOfLight.WallOfLight_eye_panel_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="光之壁线路"
m_UseMessage="这扇光之壁现在会攻击敌人而不是你"

[WatchTower.WatchTower_eye_panel_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="瞭望塔线路"
m_UseMessage="这座瞭望塔现在会射击敌人而不是你"

